    /* Задача №3: Создание и запуск простой программы
     * Перенесите скрипт в ваш файл программы и запустите созданную программу
     * public class HelloWorld {
     *      public static void main(String[] args) {
     *         System.out.println("Hello, world!");
     *      }
     * }
     */
public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello, world!");
    }
}